In [2]:
import pandas as pd
import numpy as np

In [3]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [4]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [5]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [7]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [8]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [9]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = np.nan

In [17]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [19]:
df.iloc[:4, 1] = np.nan

In [20]:
df.iloc[:2, 2] = np.nan

In [21]:
df.dropna()

          0         1         2
4 -1.218681 -0.516815 -2.283443
5 -0.754493 -0.186338 -1.058439
6  1.734066 -0.069275 -0.876572

In [22]:
df.dropna(thresh=2)

          0         1         2
2 -0.182575       NaN  1.628822
3  0.481849       NaN -0.403402
4 -1.218681 -0.516815 -2.283443
5 -0.754493 -0.186338 -1.058439
6  1.734066 -0.069275 -0.876572

In [23]:
df.fillna(0)

          0         1         2
0  0.979621  0.000000  0.000000
1 -0.526140  0.000000  0.000000
2 -0.182575  0.000000  1.628822
3  0.481849  0.000000 -0.403402
4 -1.218681 -0.516815 -2.283443
5 -0.754493 -0.186338 -1.058439
6  1.734066 -0.069275 -0.876572

In [24]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.979621  0.500000  0.000000
1 -0.526140  0.500000  0.000000
2 -0.182575  0.500000  1.628822
3  0.481849  0.500000 -0.403402
4 -1.218681 -0.516815 -2.283443
5 -0.754493 -0.186338 -1.058439
6  1.734066 -0.069275 -0.876572

In [25]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [26]:
df.iloc[2:, 1] = np.nan

In [27]:
df.iloc[4:, 2] = np.nan

In [28]:
df

          0         1         2
0 -0.836350 -1.913311 -0.421673
1 -1.763398 -0.233680 -0.737403
2  1.089744       NaN  2.152611
3 -0.515600       NaN  0.956933
4  2.161077       NaN       NaN
5 -0.965837       NaN       NaN

In [29]:
df.fillna(method="ffill")

/tmp/ipykernel_49097/3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0 -0.836350 -1.913311 -0.421673
1 -1.763398 -0.233680 -0.737403
2  1.089744 -0.233680  2.152611
3 -0.515600 -0.233680  0.956933
4  2.161077 -0.233680  0.956933
5 -0.965837 -0.233680  0.956933

In [30]:
df.fillna(method="ffill", limit=2)

/tmp/ipykernel_49097/1627181726.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)

          0         1         2
0 -0.836350 -1.913311 -0.421673
1 -1.763398 -0.233680 -0.737403
2  1.089744 -0.233680  2.152611
3 -0.515600 -0.233680  0.956933
4  2.161077       NaN  0.956933
5 -0.965837       NaN  0.956933

In [31]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [32]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [33]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
"k2": [1, 1, 2, 3, 3, 4, 4]})

In [34]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [35]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [36]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [37]:
data["v1"] = range(7)

In [38]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [41]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
"pastrami", "corned beef", "bacon",
"pastrami", "honey ham", "nova lox"],
"ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [42]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [43]:
meat_to_animal = {
"bacon": "pig",
"pulled pork": "pig",
"pastrami": "cow",
"corned beef": "cow",
"honey ham": "pig",
"nova lox": "salmon"
}

In [44]:
data["animal"] = data["food"].map(meat_to_animal)

In [46]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [47]:
def get_animal(x):
    return meat_to_animal[x]

In [48]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [49]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [50]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [51]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [52]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [53]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [54]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=["Ohio", "Colorado", "New York"],
columns=["one", "two", "three", "four"])

In [56]:
def transform(x):
    return x[:4].upper()

In [57]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [58]:
data.index = data.index.map(transform)

In [59]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [60]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [61]:
data.rename(index={"OHIO": "INDIANA"},
columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [62]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [63]:
bins = [18, 25, 35, 60, 100]

In [64]:
age_categories = pd.cut(ages, bins)

In [65]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [66]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [67]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [68]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [69]:
pd.value_counts(age_categories)

/tmp/ipykernel_49097/3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [70]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [71]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [72]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [73]:
data = np.random.uniform(size=20)

In [74]:
pd.cut(data, 4, precision=2)

[(0.5, 0.74], (0.012, 0.25], (0.012, 0.25], (0.5, 0.74], (0.74, 0.98], ..., (0.74, 0.98], (0.012, 0.25], (0.5, 0.74], (0.74, 0.98], (0.5, 0.74]]
Length: 20
Categories (4, interval[float64, right]): [(0.012, 0.25] < (0.25, 0.5] < (0.5, 0.74] < (0.74, 0.98]]

In [75]:
data = np.random.standard_normal(1000)

In [76]:
quartiles = pd.qcut(data, 4, precision=2)

In [77]:
quartiles

[(-0.67, 0.0074], (0.0074, 0.64], (0.64, 2.69], (0.64, 2.69], (-3.0399999999999996, -0.67], ..., (-0.67, 0.0074], (0.0074, 0.64], (-3.0399999999999996, -0.67], (0.0074, 0.64], (-3.0399999999999996, -0.67]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.0399999999999996, -0.67] < (-0.67, 0.0074] < (0.0074, 0.64] < (0.64, 2.69]]

In [78]:
pd.value_counts(quartiles)

/tmp/ipykernel_49097/3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.0399999999999996, -0.67]    250
(-0.67, 0.0074]                 250
(0.0074, 0.64]                  250
(0.64, 2.69]                    250
Name: count, dtype: int64

In [79]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.0309999999999997, -1.25]    100
(-1.25, 0.00744]                400
(0.00744, 1.273]                400
(1.273, 2.691]                  100
Name: count, dtype: int64

In [80]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [81]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.072794    -0.045577     0.034097    -0.004684
std       0.961389     0.984057     0.997107     1.018428
min      -3.296984    -2.971258    -2.753545    -3.795913
25%      -0.584062    -0.707715    -0.611647    -0.698896
50%       0.106363    -0.042869     0.033205    -0.002814
75%       0.723909     0.585702     0.716971     0.673892
max       2.812040     3.432786     3.003842     2.814582

In [82]:
col = data[2]

In [83]:
col[col.abs() > 3]

226    3.003842
Name: 2, dtype: float64

In [84]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
226 -0.277459 -0.127730  3.003842 -0.178377
302  1.418038  3.432786 -0.577728  1.138390
560 -0.060003  3.123282 -0.702582 -0.568384
779 -0.437213 -0.714997 -0.243926 -3.795913
910 -3.296984  1.099880 -1.112245  0.584469

In [85]:
data[data.abs() > 3] = np.sign(data) * 3

In [86]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.073091    -0.046133     0.034093    -0.003888
std       0.960392     0.982230     0.997095     1.015770
min      -3.000000    -2.971258    -2.753545    -3.000000
25%      -0.584062    -0.707715    -0.611647    -0.698896
50%       0.106363    -0.042869     0.033205    -0.002814
75%       0.723909     0.585702     0.716971     0.673892
max       2.812040     3.000000     3.000000     2.814582

In [87]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1  1.0  1.0 -1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

In [88]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

In [89]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [90]:
sampler = np.random.permutation(5)

In [91]:
sampler

array([1, 3, 0, 2, 4])

In [92]:
df.take(sampler)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34

In [93]:
df.iloc[sampler]

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34

In [94]:
df.sample(n=3)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20

In [95]:
choices = pd.Series([5, 7, -1, 6, 4])

In [96]:
choices.sample(n=10, replace=True)

0    5
2   -1
2   -1
2   -1
1    7
4    4
3    6
3    6
4    4
3    6
dtype: int64

In [97]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
"data1": range(6)})

In [98]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [100]:
pd.get_dummies(df["key"], dtype="int")

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [104]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype="int")

In [105]:
df_with_dummy = df[["data1"]].join(dummies)

In [106]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [107]:
mnames = ["movie_id", "title", "genres"]

In [108]:
movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
header=None, names=mnames, engine="python")

In [109]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [110]:
dummies = movies["genres"].str.get_dummies("|")

In [111]:
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [112]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [113]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [114]:
np.random.seed(12345)

In [115]:
values = np.random.uniform(size=10)

In [116]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [117]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [119]:
pd.get_dummies(pd.cut(values, bins), dtype="int")

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [120]:
s = pd.Series([1, 2, 3, None])

In [121]:
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [122]:
s.dtype

dtype('float64')

In [123]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())

In [124]:
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [125]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [126]:
s[3] is pd.NA

True

In [128]:
s = pd.Series([1, 2, 3, None], dtype="Int64")

In [129]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())

In [130]:
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [131]:
df = pd.DataFrame({"A": [1, 2, None, 4],
"B": ["one", "two", "three", None],
"C": [False, None, False, True]})

In [132]:
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [133]:
df["A"] = df["A"].astype("Int64")

In [134]:
df["B"] = df["B"].astype("string")

In [135]:
df["C"] = df["C"].astype("boolean")

In [136]:
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [138]:
val = "a,b,guido"

In [139]:
val.split(",")

['a', 'b', 'guido']

In [140]:
pieces = [x.strip() for x in val.split(",")]

In [141]:
pieces

['a', 'b', 'guido']

In [142]:
first, second, third = pieces

In [143]:
first + "::" + second + "::" + third

'a::b::guido'

In [144]:
"::".join(pieces)

'a::b::guido'

In [145]:
"guido" in val

True

In [146]:
val.index(",")

1

In [147]:
val.find(":")

-1

In [148]:
val.index(":")

ValueError: substring not found

In [149]:
val.count(",")

2

In [150]:
val.replace(",", "::")

'a::b::guido'

In [151]:
val.replace(",", "")

'abguido'

In [152]:
import re

In [154]:
text = "foo   bar\t baz  \tqux"

In [155]:
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [156]:
regex = re.compile(r"\s+")

In [157]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [158]:
regex.findall(text)

['   ', '\t ', '  \t']

In [159]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

In [160]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [161]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [162]:
m = regex.search(text)

In [163]:
m

In [164]:
text[m.start():m.end()]

'dave@google.com'

In [165]:
print(regex.match(text))

None

In [166]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [167]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [168]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [169]:
m = regex.match("wesm@bright.net")

In [170]:
m.groups()

('wesm', 'bright', 'net')

In [171]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [172]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [173]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
"Rob": "rob@gmail.com", "Wes": np.nan}

In [174]:
data = pd.Series(data)

In [175]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [176]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [177]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [178]:
data_as_string_ext = data.astype('string')

In [179]:
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [180]:
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [181]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [182]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [183]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

In [184]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [185]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [186]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [187]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [188]:
values = pd.Series(['apple', 'orange', 'apple',
'apple'] * 2)

In [189]:
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [190]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [191]:
pd.value_counts(values)

/tmp/ipykernel_49097/3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [192]:
values = pd.Series([0, 1, 0, 0] * 2)

In [193]:
dim = pd.Series(['apple', 'orange'])

In [194]:
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [195]:
dim

0     apple
1    orange
dtype: object

In [196]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [197]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2

In [198]:
N = len(fruits)

In [199]:
rng = np.random.default_rng(seed=12345)

In [201]:
df = pd.DataFrame({'fruit': fruits,
'basket_id': np.arange(N),
'count': rng.integers(3, 15, size=N),
'weight': rng.uniform(0, 4, size=N)},
columns=['basket_id', 'fruit', 'count', 'weight'])

In [202]:
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [203]:
fruit_cat = df['fruit'].astype('category')

In [204]:
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [205]:
c = fruit_cat.array

In [206]:
type(c)

pandas.core.arrays.categorical.Categorical

In [207]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [208]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [209]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [210]:
df['fruit'] = df['fruit'].astype('category')

In [211]:
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [212]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])

In [213]:
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [217]:
categories = ['foo', 'bar', 'baz']

In [218]:
codes = [0, 1, 2, 0, 0, 1]

In [219]:
my_cats_2 = pd.Categorical.from_codes(codes, categories)

In [220]:
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [221]:
ordered_cat = pd.Categorical.from_codes(codes, categories,
ordered=True)

In [222]:
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [223]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [224]:
rng = np.random.default_rng(seed=12345)

In [225]:
draws = rng.standard_normal(1000)

In [226]:
bins = pd.qcut(draws, 4)

In [227]:
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [228]:
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])

In [229]:
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [230]:
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [231]:
bins = pd.Series(bins, name='quartile')

In [232]:
results = (pd.Series(draws)
.groupby(bins)
.agg(['count', 'min', 'max'])
.reset_index())

/tmp/ipykernel_49097/2203082184.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins)

In [233]:
results

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [234]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [235]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)

In [236]:
cat_s = s.astype('category')

In [237]:
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [238]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [239]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [240]:
actual_categories = ['a', 'b', 'c', 'd', 'e']

In [241]:
cat_s2 = cat_s.cat.set_categories(actual_categories)

In [242]:
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [243]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [244]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [245]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]

In [246]:
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [247]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [248]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [250]:
pd.get_dummies(cat_s, dtype="int64")

   a  b  c  d
0  1  0  0  0
1  0  1  0  0
2  0  0  1  0
3  0  0  0  1
4  1  0  0  0
5  0  1  0  0
6  0  0  1  0
7  0  0  0  1